src/Documents/ОтражениеЗарплатыВУпрУчете/ОтражениеЗарплатыВУпрУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтражениеЗарплатыВУпрУчете</name>
  <comment>(Упр)</comment>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.БракВПроизводстве</registerRecords>
  <registerRecords>AccumulationRegister.УчетЗатрат</registerRecords>
  <registerRecords>AccumulationRegister.ЗатратыНаСтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.СтроительствоОбъектовОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтражениеВУчете</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособРаспределенияЗатрат</name>
      <type>
        <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатурнаяГруппа</name>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектСтроительства</name>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКосвенныхЗатрат</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
        <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/Работники/Работники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Работники</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <attributes>
    <name>ПричинаИзмененияСостояния</name>
    <type>
      <types>EnumRef.ПричиныИзмененияСостояния</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаУвольнения</name>
    <type>
      <types>CatalogRef.ОснованияУвольнения</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CalculationRegisters/УправленческиеНачисления/УправленческиеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>УправленческиеНачисления</name>
  <comment>(Упр)</comment>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ГрафикиРаботыПоВидамВремени</schedule>
  <scheduleValue>InformationRegister.ГрафикиРаботыПоВидамВремени.Resource.ОсновноеЗначение</scheduleValue>
  <scheduleDate>InformationRegister.ГрафикиРаботыПоВидамВремени.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.УправленческиеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтработаноЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУчетаВремени</name>
    <type>
      <types>EnumRef.ВидыУчетаВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Авторасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоВременнойСхемеМотивации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>ВидСхемыМотивации</name>
    <type>
      <types>CatalogRef.ВариантыCхемМотивации</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

src/InformationRegisters/УчетЗаработкаРаботников/УчетЗаработкаРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетЗаработкаРаботников</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособОтраженияВУпрУчете</name>
    <type>
      <types>CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</types>
    </type>
  </resources>
  <resources>
    <name>УчетНачисленийПоОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CalculationRegisters/ВзносыВФонды/ВзносыВФонды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВзносыВФонды</name>
  <comment>(регл)</comment>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВзносыВФонды</chartOfCalculationTypes>
  <resources>
    <name>База</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БазаВзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Налог</name>
    <type>
      <types>CatalogRef.Налоги</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПорога</name>
    <type>
      <types>EnumRef.ПорогиШкалыСтавокНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <comment>Период параметров налога начало</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <comment>Период параметров налога конец</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предел</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяНалоговойДекларации</name>
    <type>
      <types>CatalogRef.СтатьиНалоговыхДеклараций</types>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Авторасчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиТЧ</name>
    <comment>Для разделения табличных частей Взносы и ВзносыФОТ</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтработаноДнейВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>КодКатегорииЗЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БазаВычет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.СотрудникиОрганизаций</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>ПерерасчетВзносовВФонды</name>
    <dimensions>
      <name>Сотрудник</name>
    </dimensions>
    <dimensions>
      <name>Организация</name>
    </dimensions>
  </recalculations>
</mdclass:CalculationRegister>

src/Enums/ПричиныИзмененияСостояния/ПричиныИзмененияСостояния.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныИзмененияСостояния</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ПриемНаРаботу</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Увольнение</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

src/Enums/ХарактерЗатрат/ХарактерЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХарактерЗатрат</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>БракВПроизводстве</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВложенияВоВнеоборотныеАктивы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>РасходыНаСбыт</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОбщепроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>АдминистративныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроизводственныеРасходы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочие</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперационныеРасходы</name>
  </enumValues>
  <enumValues>
    <name>НеУчитываемыеВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ТранспортноЗаготовительныеРасходы</name>
  </enumValues>
</mdclass:Enum>

src/Enums/КодыОперацийЗатраты/КодыОперацийЗатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КодыОперацийЗатраты</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СписаниеПартийВПроизводствоОперативно</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеПостоянныеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ВнутренниеУслугиНаПостоянныеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>УслугиКонтрагентаНаПостоянныеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеАдминистративныеРасходы_Регламент</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеОбщепроизводственныеРасходы_Регламент</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеТранспортноЗаготовительныеРасходы_Регламент</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СписаниеЗатрат</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидыОтраженияВУчете/ВидыОтраженияВУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОтраженияВУчете</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОтражатьВУправленческомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВБухгалтерскомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВМеждународномУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВНалоговомУчете</name>
  </enumValues>
  <enumValues>
    <name>ОтражатьВРегламентированномУчете</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ОтражениеЗарплатыВУпрУчете/ObjectModule.bsl
Перем мУдалятьДвижения;

////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПроверкаНаПустойСпособ( ИмяПараметра )
	
	ТекстПроверки = "
	|	ВЫБОР	КОГДА		Начисления.ВидРасчета.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ 
	|				ТОГДА	Начисления.ВидРасчета.СпособОтраженияВУпрУчете." + ИмяПараметра + "  					
	|			КОГДА		УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ 
	|					И	НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL 
	|				ТОГДА	УчетЗаработкаРаботников.СпособОтраженияВУпрУчете." + ИмяПараметра + " 			
	|			ИНАЧЕ		&парамСпособПоУмолчанию" + ИмяПараметра + "  		КОНЕЦ
	|";
		
	Возврат ТекстПроверки;
КонецФункции // ПроверкаНаПустойСпособБУ()

Функция ПроверкаНаПустойСпособВзносы( ИмяПараметра )
	
	ТекстПроверки = "
	|	ВЫБОР	КОГДА		УчетЗаработкаРаботников.СпособОтраженияВУпрУчете <> &парамПустойСпособУУ 
	|					И	НЕ УчетЗаработкаРаботников.СпособОтраженияВУпрУчете ЕСТЬ NULL 
	|				ТОГДА	УчетЗаработкаРаботников.СпособОтраженияВУпрУчете." + ИмяПараметра + " 			
	|			ИНАЧЕ		&парамСпособПоУмолчанию" + ИмяПараметра + "  		КОНЕЦ
	|";
		
	Возврат ТекстПроверки;
КонецФункции // ПроверкаНаПустойСпособБУ()

Процедура Автозаполнение() Экспорт
 	Перем ВалютаУпрУчета;
	Перем КурсВалютыУпрУчета;

	ВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	ПроведениеРасчетов.ПолучитьКурсВалютыУпрУчета(ПериодРегистрации, ВалютаУпрУчета, КурсВалютыУпрУчета, ВалютаРегламентированногоУчета);
	
	ОтражениеВУчете.Очистить();
	
	// ДанныеУпрУчета
	//	Поля:
	//		СтатьяЗатрат           	- статья затрат управленческго учета
	//		НоменклатурнаяГруппа	- номенклатурная группа управленческго учета
	//		Подразделение
	//		Результат
	//
	//	Описание:
	//	Содержит данные для отражения начисленй в упр. учете
	РаботникПериодПодразделение = "
	|				ВЫБРАТЬ
	|					Работники.ФизЛицо КАК ФизЛицо,
	|					КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ) КАК Период,
	|					Работники.Подразделение КАК Подразделение
	|				ИЗ  РегистрСведений.Работники.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)) КАК Работники
	|			
	|			    ОБЪЕДИНИТЬ
	|				ВЫБРАТЬ
	|					Работники.ФизЛицо КАК ФизЛицо,
	|					Работники.Период КАК Период,
	|					Работники.Подразделение КАК Подразделение
	|				ИЗ  РегистрСведений.Работники.СрезПоследних(КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)) КАК Работники
	|			    ГДЕ
	|			        Работники.Период >= &парамПериодРегистрации
	|			    И   Работники.Период <= КОНЕЦПЕРИОДА(&парамПериодРегистрации, МЕСЯЦ)
	|			    И   ПричинаИзмененияСостояния = &Увольнение
	|";
	
	ДанныеУпрУчетаТекст = "
	|ВЫБРАТЬ
	|	ВсеНачисления.СтатьяЗатрат				КАК СтатьяЗатрат,
	|	ВсеНачисления.НоменклатурнаяГруппа		КАК НоменклатурнаяГруппа,
	|	ВсеНачисления.СпособРаспределенияЗатрат	КАК СпособРаспределенияЗатрат,
	|	ВсеНачисления.ОбъектСтроительства 		КАК ОбъектСтроительства,
	|	ВсеНачисления.Подразделение КАК Подразделение,
	|	СУММА(ВсеНачисления.Сумма) КАК Сумма,
	|	СУММА(ВсеНачисления.СуммаКосвенныхЗатрат) КАК СуммаКосвенныхЗатрат
	|ИЗ (
	|	ВЫБРАТЬ
	|	" + ПроверкаНаПустойСпособ( "СтатьяЗатрат" ) + "				КАК СтатьяЗатрат,
	|	" + ПроверкаНаПустойСпособ( "НоменклатурнаяГруппа" ) + "		КАК НоменклатурнаяГруппа,
	|	" + ПроверкаНаПустойСпособ( "СпособРаспределенияЗатрат" ) + "	КАК СпособРаспределенияЗатрат,
	|	" + ПроверкаНаПустойСпособ( "ОбъектСтроительства" ) + " 		КАК ОбъектСтроительства,
	|	Начисления.Подразделение	КАК Подразделение,
	|	Начисления.Результат		КАК Сумма,
	|	0 							КАК СуммаКосвенныхЗатрат
	|	ИЗ  РегистрРасчета.УправленческиеНачисления КАК Начисления
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Начисления.ФизЛицо КАК ФизЛицо,
	|				МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период
	|			ИЗ
	|				РегистрРасчета.УправленческиеНачисления КАК Начисления
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|					ПО Начисления.ФизЛицо = УчетЗаработкаРаботников.Физлицо И УчетЗаработкаРаботников.Период <= Начисления.ПериодДействияНачало
	|			
	|			ГДЕ
	|				Начисления.ПериодРегистрации = &парамПериодРегистрации
	|			
	|			СГРУППИРОВАТЬ ПО
	|				Начисления.ФизЛицо) КАК СведенияОРаботникахСрез
	|			ПО СведенияОРаботникахСрез.ФизЛицо = УчетЗаработкаРаботников.Физлицо И СведенияОРаботникахСрез.Период = УчетЗаработкаРаботников.Период
	|		ПО УчетЗаработкаРаботников.Физлицо = Начисления.ФизЛицо
	|
	|	ГДЕ
	|		Начисления.ПериодРегистрации = &парамПериодРегистрации
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|	ВЫБРАТЬ
	|		" + ПроверкаНаПустойСпособВзносы( "СтатьяЗатрат" ) + "				КАК СтатьяЗатрат,
	|		" + ПроверкаНаПустойСпособВзносы( "НоменклатурнаяГруппа" ) + "		КАК НоменклатурнаяГруппа,
	|		" + ПроверкаНаПустойСпособВзносы( "СпособРаспределенияЗатрат" ) + "	КАК СпособРаспределенияЗатрат,
	|		" + ПроверкаНаПустойСпособВзносы( "ОбъектСтроительства" ) + " 		КАК ОбъектСтроительства,
	|		СведенияОРаботниках.Подразделение КАК Подразделение,
	|		0 КАК Сумма,
	|		Начисления.Результат / &КурсВалютыУпрУчета КАК СуммаКосвенныхЗатрат
	|	ИЗ РегистрРасчета.ВзносыВФонды КАК Начисления
	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (
	|				ВЫБРАТЬ
	|					РаботникПериод.ФизЛицо КАК ФизЛицо,
	|					МАКСИМУМ(УчетЗаработкаРаботников.Период) КАК Период
	|				ИЗ ( " + РаботникПериодПодразделение + " ) КАК РаботникПериод
	|			
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетЗаработкаРаботников КАК УчетЗаработкаРаботников
	|				ПО		РаботникПериод.ФизЛицо = УчетЗаработкаРаботников.Физлицо 
	|					И 	УчетЗаработкаРаботников.Период <= РаботникПериод.Период
	|			
	|				СГРУППИРОВАТЬ ПО
	|					РаботникПериод.ФизЛицо
	|			
	|			) КАК СведенияОРаботникахСрез
	|			ПО		СведенияОРаботникахСрез.ФизЛицо = УчетЗаработкаРаботников.Физлицо 
	|				И	СведенияОРаботникахСрез.Период = УчетЗаработкаРаботников.Период
	|				
	|		ПО УчетЗаработкаРаботников.Физлицо = Начисления.Сотрудник.ФизЛицо
	|		
	|		ЛЕВОЕ СОЕДИНЕНИЕ ( " + РаботникПериодПодразделение + " ) КАК СведенияОРаботниках
	|		ПО		СведенияОРаботниках.ФизЛицо = Начисления.Сотрудник.Физлицо 
	|				
	|	ГДЕ
	|		Начисления.ПериодРегистрации = &парамПериодРегистрации
	|		И Начисления.ВидРасчета.СпособРасчета = &ВзносыФОТ
	|   ) КАК ВсеНачисления
	|
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеНачисления.СтатьяЗатрат,
	|	ВсеНачисления.НоменклатурнаяГруппа,
	|	ВсеНачисления.СпособРаспределенияЗатрат,
	|	ВсеНачисления.ОбъектСтроительства,
	|	ВсеНачисления.Подразделение
	|	";
	
	Запрос = Новый Запрос(ДанныеУпрУчетаТекст);
	
	Запрос.УстановитьПараметр("парамПустойСпособУУ", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ПустаяСсылка());
	Запрос.УстановитьПараметр("парамСпособНеОтражать", Справочники.СпособыОтраженияЗарплатыВУпрУчете.НеОтражатьВУпручете);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСтатьяЗатрат", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.СтатьяЗатрат);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюНоменклатурнаяГруппа", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.НоменклатурнаяГруппа);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюСпособРаспределенияЗатрат", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.СпособРаспределенияЗатрат);
	Запрос.УстановитьПараметр("парамСпособПоУмолчаниюОбъектСтроительства", Справочники.СпособыОтраженияЗарплатыВУпрУчете.ОтражениеНачисленийПоУмолчанию.ОбъектСтроительства);
	Запрос.УстановитьПараметр("парамПериодРегистрации", ПериодРегистрации);
	
	Запрос.УстановитьПараметр("НачисленоПоБухгалтерииСдельно", ПланыВидовРасчета.УправленческиеНачисления.НачисленоПоБухгалтерииСдельно);
	Запрос.УстановитьПараметр("СдельныйЗаработок", Перечисления.СпособыРасчетаОплатыТруда.СдельныйЗаработок);
	Запрос.УстановитьПараметр("КурсВалютыУпрУчета", КурсВалютыУпрУчета);
	Запрос.УстановитьПараметр("ВзносыФОТ", Перечисления.СпособыРасчетаОплатыТруда.ВзносыФОТ);
	Запрос.УстановитьПараметр("Увольнение", Перечисления.ПричиныИзмененияСостояния.Увольнение);
	                            
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Строка = ОтражениеВУчете.Добавить();
		
		Строка.Подразделение = Выборка.Подразделение;
		Строка.СтатьяЗатрат = Выборка.СтатьяЗатрат;
		Строка.НоменклатурнаяГруппа = Выборка.НоменклатурнаяГруппа;
		Строка.СпособРаспределенияЗатрат = Выборка.СпособРаспределенияЗатрат;
		Строка.ОбъектСтроительства = Выборка.ОбъектСтроительства;
		Строка.Сумма = Выборка.Сумма;
		Строка.СуммаКосвенныхЗатрат = Выборка.СуммаКосвенныхЗатрат;
		
	КонецЦикла;
	
КонецПроцедуры //  Автозаполнение

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА


// Формирует запрос по табличной части ОтражениеВУчете
//
//
// Возвращаемое значение:
//  Результат запроса
//
Функция СформироватьЗапросПоДоходам()
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Отражение.НомерСтроки,
	|	Отражение.Подразделение,
	|	Отражение.СтатьяЗатрат,
	|	Отражение.НоменклатурнаяГруппа,
	|	Отражение.СтатьяЗатрат.ХарактерЗатрат Как ХарактерЗатрат,
	|	Отражение.Проект,
	|	Отражение.СпособРаспределенияЗатрат КАК СпособРаспределенияЗатратНаВыпуск,
	|	Отражение.ОбъектСтроительства,
	|	Отражение.Сумма КАК Сумма,
	|	Отражение.СуммаКосвенныхЗатрат КАК СуммаКосвенныхЗатрат
	|ИЗ
	|	Документ.ОтражениеЗарплатыВУпрУчете.ОтражениеВУчете КАК Отражение
	|
	|ГДЕ
	|	Отражение.Ссылка = &парамРегистратор
	|
	|");
	
	Запрос.УстановитьПараметр("парамРегистратор", Ссылка);
	Возврат Запрос.Выполнить();
КонецФункции

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//  Отказ 					- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеШапки(Отказ)

	Если НЕ ЗначениеЗаполнено(ПериодРегистрации) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не задан период за который выполняется отражение начислений учете!", Отказ);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Проверяет правильность заполнения реквизитов в строке ТЧ "ОтражениеВУчете" документа.
// Если какой-то из реквизтов, влияющий на проведение, не заполнен или
// заполнен некорректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса к ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры: 
//  ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//  ВыборкаПоСтрокамДокумента	- спозиционированная на определеной строке выборка 
//  							  из результата запроса к ТЧ документа, 
//  Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиДохода(ВыборкаПоДоходам, Отказ)
	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоДоходам.НомерСтроки)+": ";

	Если ВыборкаПоДоходам.Подразделение.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указано подразделение!", Отказ);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана статья затрат!", Отказ);
	КонецЕсли;
	
	Если ВыборкаПоДоходам.ХарактерЗатрат = Перечисления.ХарактерЗатрат.ВложенияВоВнеоборотныеАктивы и 
		НЕ ЗначениеЗаполнено(ВыборкаПоДоходам.ОбъектСтроительства) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не задан объект строительства!", Отказ);
	КонецЕсли;
	
	
Конецпроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	Перем ВалютаУпрУчета;
	Перем КурсВалютыУпрУчета;
	
	Если мУдалятьДвижения Тогда
		ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	ПроверитьЗаполнениеШапки(Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаПоДоходам = СформироватьЗапросПоДоходам().Выгрузить();
	
	Для каждого СтрокаТаблицы из ТаблицаПоДоходам Цикл
		ПроверитьЗаполнениеСтрокиДохода(СтрокаТаблицы, Отказ);
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// подготовим общую сумму
	Для каждого СтрокаТаблицы из ТаблицаПоДоходам Цикл
		СтрокаТаблицы.Сумма = СтрокаТаблицы.Сумма + СтрокаТаблицы.СуммаКосвенныхЗатрат;
	КонецЦикла;
	
	ТаблицаПоДоходам.Свернуть("Подразделение,СтатьяЗатрат,Проект,НоменклатурнаяГруппа,СпособРаспределенияЗатратНаВыпуск,ОбъектСтроительства","Сумма");
	
	ТаблицаЗатрат = УправлениеЗатратами.СформироватьТаблицуЗатрат();
	
	ОбщегоНазначения.ЗагрузитьВТаблицуЗначений(ТаблицаПоДоходам,ТаблицаЗатрат);

	Если ТаблицаЗатрат.Количество() > 0 Тогда
		
		ДопПараметры = Новый Структура;
		ДопПараметры.Вставить("КодОперацииНЗП",  Перечисления.КодыОперацийНезавершенноеПроизводство.СписаниеПрочихЗатратВПроизводство);
		ДопПараметры.Вставить("КодОперацииЗатр", Перечисления.КодыОперацийЗатраты.ПрочиеПостоянныеЗатраты);
		
		ВремСтруктураШапкиДокумента = Новый Структура;
		ВремСтруктураШапкиДокумента.Вставить("ОтражатьВУправленческомУчете", Истина);
		ВремСтруктураШапкиДокумента.Вставить("Ссылка", Ссылка);
		ВремСтруктураШапкиДокумента.Вставить("Дата", КонецМесяца(ПериодРегистрации));
		
		ВремСтруктураШапкиДокумента.Вставить("ВидДокумента",  "ОтражениеЗарплатыВУпрУчете");
		
		
		УправлениеЗатратами.ДвиженияПоПрочимЗатратам(
			ВремСтруктураШапкиДокумента,
			ТаблицаЗатрат,
			Перечисления.ВидыОтраженияВУчете.ОтражатьВУправленческомУчете
		);
		
		
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;

	мУдалятьДвижения = НЕ ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры
